rubyonrails/micro-reddit/app/controllers/posts_controller.rb

  def show
    set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "test"], ["created_at", "2022-05-04 08:16:16.520203"], ["updated_at", "2022-05-04 08:16:16.520203"], ["user_id", 1]]

  def destroy
    set_post
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]