rubyonrails/micro-reddit/app/views/comments/_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p>
  <strong><%= User.find(comment.user_id).username%>:</strong>