rubyonrails/micro-reddit/app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <div class="footer-post">
          <%= User.find(post.user_id).username%>